_Rarzrabotki/Kazna/Documents/ЗаявкаНаРасходованиеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ЗаявкаНаРасходованиеДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.СчетНаОплатуПоставщика</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СчетаНал</xr:Item>
				<xr:Item>AccumulationRegister.ЛимитыДДС</xr:Item>
				<xr:Item>AccumulationRegister.ЗаявкиНаРасходованиеДС</xr:Item>
				<xr:Item>AccumulationRegister.БДДС</xr:Item>
				<xr:Item>AccumulationRegister.СчетаПоставщиков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНаОплатуПоставщика</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Comment>(Общ) Банковский счет контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПриоритетыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Секция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Секции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПревышениеБюджета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПревышенияБюджета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ФинАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Финагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ПроцентФинАгента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ДатаВозвратаФинАгента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Kazna/AccumulationRegisters/СчетаПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>СчетаПоставщиков</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаОплату</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВКБ</Name>
					<Comment>Движение по заявке, если она по счету на оплату поставщику (+дата документа, "-" дата платежа)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетНаОплатуПоставщика</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/AccumulationRegisters/ЗаявкиНаРасходованиеДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаявкиНаРасходованиеДС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаРасходованиеДС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/AccumulationRegisters/ЛимитыДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ЛимитыДДС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/AccumulationRegisters/СчетаНал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>СчетаНал</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/InformationRegisters/ОтметкиРегистрацииНН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОтметкиРегистрацииНН</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/AccumulationRegisters/БюджетыНаМесяц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>БюджетыНаМесяц</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоказательБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиБюджетов</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияДвиженийДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПериодовБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ВидыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыДенежныхСредств</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ВидыОперацийСчетНаОплатуПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСчетНаОплатуПоставщику</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаОплату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транзит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Documents/ЗаявкаНаРасходованиеДенежныхСредств/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//По бюджетам, помесячно
	Ответ = ПроверитьНаСоответствиеЛимитов();
	Если НЕ Ответ.Результат Тогда
		//МожноПревышатьЛимит,СуммаПревышения
		Если Ответ.МожноПревышатьЛимит Тогда
			локОтказ= Ложь;
			//**ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ответ.ТекстОшибки, Ссылка, , , локОтказ);
		Иначе	
			//**ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ответ.ТекстОшибки, Ссылка, , , Отказ);
		КонецЕсли;
	КонецЕсли;	
	
	//По лимитам, с вторника по понедельник  по статьяим ддс
	Ответ = ПроверитьНаСоответствиеЛимитовОригинал();
	Если НЕ Ответ.Результат Тогда
		//МожноПревышатьЛимит,СуммаПревышения
		Если Ответ.МожноПревышатьЛимит Тогда
			локОтказ= Ложь;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ответ.ТекстОшибки, Ссылка, , , локОтказ);
		Иначе	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ответ.ТекстОшибки, Ссылка, , , Отказ);
		КонецЕсли;
	КонецЕсли;	
	
	
	
	// регистр СчетаПоставщиков Приход
	Движения.СчетаПоставщиков.Записывать = Истина;
	Если ЗначениеЗаполнено(СчетНаОплатуПоставщика) И ТипЗнч(СчетНаОплатуПоставщика) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
		Движение 				= Движения.СчетаПоставщиков.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Период 		= Дата;
		Движение.СчетНаОплатуПоставщика = СчетНаОплатуПоставщика;
		Движение.Сумма 			= СуммаДокумента;
		Движение.НаОплату 		= 0;
		
		Движение 				= Движения.СчетаПоставщиков.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.СчетНаОплатуПоставщика = СчетНаОплатуПоставщика;
		Движение.НаОплату 		= СуммаДокумента;
		Движение.Сумма			= 0;
		
		
	КонецЕсли;
	Движения.ЗаявкиНаРасходованиеДС.Записывать = Истина;
	Движение 				= Движения.ЗаявкиНаРасходованиеДС.Добавить();
	Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
	Движение.Период 		= Дата;
	Движение.ЗаявкаНаРасходованиеДС = Ссылка;
	Движение.Сумма			= СуммаДокумента;
	
	Если Движения.ЛимитыДДС.НадоСписыватьЛимиты(ЭтотОбъект) Тогда
		Движения.ЛимитыДДС.ВыполнитьРасход(ЭтотОбъект);
	КонецЕсли; 
	
	
	//++ Бахтишаев А.Э. , 09/11/16 06:15,393
	// Т.к. в 1С неленивое "И", делаем вложенным условием
	Если ЗначениеЗаполнено(СчетНаОплатуПоставщика) Тогда
		Если Константы.ДатаНачалаРаботыПоНовойСхемеТранзитаДС.Получить() <= Дата И СчетНаОплатуПоставщика.ВидОплаты = Перечисления.ВидыДенежныхСредств.Наличные Тогда
			Движения.СчетаНал.ВыполнитьПриходДляПодчиненного(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	//-- Бахтишаев А.Э. , 09/11/16 06:16
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	Подразделение = Ответственный.Подразделение;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
		// Заполнение шапки
		ВалютаДокумента 	= ДанныеЗаполнения.ВалютаДокумента;
		ВидОплаты 			= ДанныеЗаполнения.ВидОплаты;
		Комментарий 		= ДанныеЗаполнения.Комментарий;
		Контрагент 			= ДанныеЗаполнения.Контрагент;
		НазначениеПлатежа 	= ДанныеЗаполнения.НазначениеПлатежа;
		Организация 		= ДанныеЗаполнения.Организация;
		//Ответственный 	= ДанныеЗаполнения.Ответственный;
		ПлановаяДатаОплаты	= ДанныеЗаполнения.ПлановаяДатаОплаты;
		Подразделение		= ДанныеЗаполнения.Подразделение;
		СчетНаОплатуПоставщика = ДанныеЗаполнения.Ссылка;
		СтатьяДвиженияДенежныхСредств = ДанныеЗаполнения.СтатьяДвиженияДенежныхСредств;
		СуммаДокумента		= ДанныеЗаполнения.СуммаДокумента; 
		СчетКонтрагента		= ДанныеЗаполнения.СчетКонтрагента;
		ДокументОснование	= ДанныеЗаполнения;
		СчетНаОплатуПоставщика =  ДанныеЗаполнения;
		Секция				= ДанныеЗаполнения.Секция;   
		//Тютюн    
		
		Если ДанныеЗаполнения.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("УТ-001096") ТОгда 
			_ФинАгент              = ДанныеЗаполнения._ФинАгент;  
			_ПроцентФинАгента      = ДанныеЗаполнения._ПроцентФинАгента;
			_ДатаВозвратаФинАгента = ДанныеЗаполнения._ДатаВозвратаФинАгента;
		КонецЕсли;
		
		лЗапрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(Т_ОстатокСчета.СуммаОстаток, 0) КАК Сумма_Счет,
		|	ЕСТЬNULL(Т_Лимиты.СуммаОстаток, 0) КАК Сумма_Лимит,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Т_ОстатокСчета.СуммаОстаток, 0) > ЕСТЬNULL(Т_Лимиты.СуммаОстаток, 0)
		|			ТОГДА ЕСТЬNULL(Т_Лимиты.СуммаОстаток, 0)
		|		ИНАЧЕ ЕСТЬNULL(Т_ОстатокСчета.СуммаОстаток, 0)
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	РегистрНакопления.СчетаПоставщиков.Остатки(, СчетНаОплатуПоставщика = &СчетНаОплатуПоставщика) КАК Т_ОстатокСчета,
		|	РегистрНакопления.ЛимитыДДС.Остатки(, Подразделение = &Подразделение) КАК Т_Лимиты");
		лЗапрос.УстановитьПараметр("СчетНаОплатуПоставщика",  	ДанныеЗаполнения);
		лЗапрос.УстановитьПараметр("Подразделение", 			Подразделение);
		лВыборка = лЗапрос.Выполнить().Выбрать();
		
		//2016/06 Сава: Отключаем лимиты (причина - сейчас схема: Утвердили = оплатили);
		лДата = Константы.Лимиты_ДатаНачалаИспользования.Получить();
		
		Если ДанныеЗаполнения.ВидОперации<>Перечисления.ВидыОперацийСчетНаОплатуПоставщику.Транзит
			И ЗначениеЗаполнено(лДата) И лДата <= ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата() ) Тогда 
			СуммаДокумента = ?(лВыборка.Следующий(), лВыборка.Сумма , 0);
		Иначе
			СуммаДокумента = ?(лВыборка.Следующий(), лВыборка.Сумма_Счет, 0);
		КонецЕсли;
		
		
		//80\20                   
		
		Если ДанныеЗаполнения.СтавкаНДС=Перечисления.СтавкиНДС.НДС20  И Константы.ИспользоватьПроверку80_20.Получить() Тогда
			Если РегистрыСведений.ОтметкиРегистрацииНН.ННЗарегистирована(ДанныеЗаполнения) Тогда
			    //Сумму не режем
			Иначе	
			   СуммаДокумента= Окр(СуммаДокумента*0.8,2);
			   Сообщить("Документ "+ДанныеЗаполнения+", оплата 80% от суммы документа",СтатусСообщения.ОченьВажное);
			КонецЕсли;
		КонецЕсли;

		
		Если ДанныеЗаполнения.ВидОплаты = Перечисления.ВидыДенежныхСредств.Безналичные Тогда
			Если ТипЗнч(ДокументОснование.Секция)=Тип("СправочникСсылка.Секции")
				И ЗначениеЗаполнено(ДокументОснование.Секция.ОсновнойБанковскийСчет) Тогда
				СтруктурнаяЕдиница = ДокументОснование.Секция.ОсновнойБанковскийСчет;
			Иначе
				СтруктурнаяЕдиница = Организация.ОсновнойБанковскийСчет;				
			КонецЕсли;
		Иначе
			СтруктурнаяЕдиница = Организация.ОсновнаяКасса;
		КонецЕсли;
		
		//Тютюн         
		Если ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийСчетНаОплатуПоставщику.Перемещение Тогда  
			СтруктурнаяЕдиница = ДанныеЗаполнения._Касса ;
		КонецЕсли;
		//КонецИзменений
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьНаСоответствиеЛимитовОригинал()Экспорт
	
	//++ Павел Чистяков 24.05.2016 14:02:59 
	Если Не Движения.ЛимитыДДС.НадоСписыватьЛимиты(ЭтотОбъект) Тогда
		Возврат Новый Структура("Результат,ТекстОшибки",Истина,"");
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура("Результат,ТекстОшибки,МожноПревышатьЛимит",Ложь,"",Ложь);
	//СтруктураОтвета.МожноПревышатьЛимит=РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ПолныеПрава");
	СтруктураОтвета.МожноПревышатьЛимит=ЛОЖЬ;;
	
	Запрос = Новый Запрос;
	Запрос.Текст=  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СУММА(ЛимитыДДСОбороты.СуммаПриход - ЛимитыДДСОбороты.СуммаРасход) КАК Лимит_СуммаОстаток
	               |ПОМЕСТИТЬ НужныеЛимиты
	               |ИЗ
	               |	РегистрНакопления.ЛимитыДДС.Обороты(
	               |			&НачДата,
	               |			&КонДата,
	               |			,
	               |			ВидОплаты = &ВидОплаты
	               |				И Подразделение = &Подразделение И Направление = &Направление 
	               //**|				И СтатьяДвиженияДенежныхСредств = &СтатьяДвиженияДенежныхСредств
				   |) КАК ЛимитыДДСОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(СчетаПоставщиковОстатки.СуммаОстаток, 0) КАК Счет_СуммаОстаток,
	               |	ЕСТЬNULL(НужныеЛимиты.Лимит_СуммаОстаток,0) Как  Лимит_СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.СчетаПоставщиков.Остатки(, СчетНаОплатуПоставщика = &СчетНаОплатуПоставщика) КАК СчетаПоставщиковОстатки,
	               |	НужныеЛимиты КАК НужныеЛимиты"  ;
				   
				   
	Если ЗначениеЗаполнено(СчетНаОплатуПоставщика.Направление) Тогда
		локНаправление = СчетНаОплатуПоставщика.Направление;
	Иначе
		локНаправление=Справочники.Направления.ПустаяСсылка();
	КонецЕсли;			   
	
	Если локНаправление.ЛимитВЦеломПоНаправлению Тогда
	    Запрос.Текст=СтрЗаменить(Запрос.Текст,"И Подразделение = &Подразделение","");
	КонецЕсли;
	ЗАпрос.УстановитьПараметр("Направление",			локНаправление);
	//Вторник - понедельник
	ТекДень=ДеньНедели(Дата);
	Если ТекДень=1 Тогда
		НачДата =Дата-60*60*24*6; 
		КонДата=Дата;
	Иначе
		НачДата=НачалоНедели(Дата)+ 60*60*24*1;
		КонДата=КонецНедели(Дата)+ 60*60*24*1;
	КонецЕсли;
	
	ЗАпрос.УстановитьПараметр("НачДата",				НачалоДня(НачДата));
	ЗАпрос.УстановитьПараметр("КонДата",				КонецДня(КонДата));
	ЗАпрос.УстановитьПараметр("Организация",			Организация);
	ЗАпрос.УстановитьПараметр("Подразделение",			Подразделение);
	ЗАпрос.УстановитьПараметр("ВидОплаты",				ВидОплаты);
	ЗАпрос.УстановитьПараметр("СчетНаОплатуПоставщика", ДокументОснование);
	ЗАпрос.УстановитьПараметр("СтатьяДвиженияДенежныхСредств",СтатьяДвиженияДенежныхСредств);
	ЗАпрос.УстановитьПараметр("ВидОплаты",ВидОплаты);
	ЗАпрос.УстановитьПараметр("СтатьяДвиженияДенежныхСредств",СтатьяДвиженияДенежныхСредств);
	
	Выборка = запрос.Выполнить().Выбрать();
	
	//Сава: 2016/05 - на перспективу, если нет счета
	Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда 
		Если Выборка.Следующий() Тогда
			Если 	Выборка.Лимит_СуммаОстаток>=СуммаДокумента 
				И	Выборка.Счет_СуммаОстаток >=СуммаДокумента	Тогда
				СтруктураОтвета.Результат=Истина;
			Иначе
				СтруктураОтвета.ТекстОшибки="Проверка 3. "+
				?(Выборка.Лимит_СуммаОстаток>=СуммаДокумента, "",  " Превышен лимит расхода на "+(-Выборка.Лимит_СуммаОстаток+СуммаДокумента))
				+?(Выборка.Счет_СуммаОстаток >=СуммаДокумента, "",  ", Превышена сумма по счету на "+(-Выборка.Счет_СуммаОстаток+СуммаДокумента)); 
				СтруктураОтвета.ТекстОшибки = СокрЛП(Сред(СтруктураОтвета.ТекстОшибки, 2) );
			КонецЕсли;
		Иначе	
			СтруктураОтвета.ТекстОшибки="Проверка 3. "+"Превышен лимит расхода и сумма по счету на "+СуммаДокумента ;
		КонецЕсли;
	Иначе 
		Если Выборка.Следующий() Тогда
			Если 	Выборка.Лимит_СуммаОстаток>=СуммаДокумента Тогда
				СтруктураОтвета.Результат=Истина;
			Иначе
				СтруктураОтвета.ТекстОшибки="Проверка 3. "+
				?(Выборка.Лимит_СуммаОстаток>=СуммаДокумента, "",  " Превышен лимит расхода на "+(-Выборка.Лимит_СуммаОстаток+СуммаДокумента));
			КонецЕсли;
		Иначе	
			СтруктураОтвета.ТекстОшибки="Проверка 3. "+"Превышен лимит расхода на "+СуммаДокумента ;
		КонецЕсли;	 
	КонецЕсли;
	
	Возврат СтруктураОтвета;
	
КонецФункции



Функция ПроверитьНаСоответствиеЛимитов()Экспорт
	
	////++ Павел Чистяков 24.05.2016 14:02:59 
	//Если Не Движения.ЛимитыДДС.НадоСписыватьЛимиты(ЭтотОбъект) Тогда
	//	Возврат Новый Структура("Результат,ТекстОшибки",Истина,"");
	//КонецЕсли;
	
	СтруктураОтвета = Новый Структура("Результат,ТекстОшибки,МожноПревышатьЛимит,СуммаПревышения",Ложь,"",Ложь,0);
	//СтруктураОтвета = Новый Структура("Результат,ТекстОшибки",Истина,"");
	//Возврат СтруктураОтвета ; 
	
	СтруктураОтвета.МожноПревышатьЛимит=РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ПолныеПрава");
	//СтруктураОтвета.МожноПревышатьЛимит=Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст=  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БюджетыНаМесяцОбороты.СуммаОборот
	|ПОМЕСТИТЬ Запланировано
	|ИЗ
	|	РегистрНакопления.БюджетыНаМесяц.Обороты(
	|			&НачДата,
	|			&КонДата,
	|			,
	|			Подразделение = &Подразделение
	|				И ПоказательБюджета = &СтатьяДвиженияДенежныхСредств
	|				И ВидПериода <> &ВидПериодаОбъект
	|				И ВидОплаты = &ВидОплаты) КАК БюджетыНаМесяцОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БДДСОбороты.СуммаОборот
	|ПОМЕСТИТЬ Потрачено
	|ИЗ
	|	РегистрНакопления.БДДС.Обороты(
	|			&НачДата,
	|			&КонДата,
	|			,
	|			Подразделение = &Подразделение
	|				И ВидОплаты = &ВидОплаты
	|				И СтатьяДвиженияДенежныхСредств = &СтатьяДвиженияДенежныхСредств) КАК БДДСОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Запланировано.СуммаОборот, 0) - ЕСТЬNULL(Потрачено.СуммаОборот, 0) КАК СуммаОстаток
	|ИЗ
	|	Запланировано КАК Запланировано,
	|	Потрачено КАК Потрачено";
	
	
	ЗАпрос.УстановитьПараметр("НачДата",				НачалоМесяца(Дата));
	ЗАпрос.УстановитьПараметр("КонДата",				КонецМесяца(Дата));
	
	ЗАпрос.УстановитьПараметр("Организация",			Организация);
	ЗАпрос.УстановитьПараметр("Подразделение",			Подразделение);
	ЗАпрос.УстановитьПараметр("ВидОплаты",				ВидОплаты);
	ЗАпрос.УстановитьПараметр("ВидПериодаОбъект",				Перечисления.ВидыПериодовБюджетирования.Объект);
	ЗАпрос.УстановитьПараметр("СтатьяДвиженияДенежныхСредств",СтатьяДвиженияДенежныхСредств);
	
	Выборка = запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Выборка.СуммаОстаток >=СуммаДокумента Тогда
			СтруктураОтвета.Результат=Истина;
		Иначе	
			СтруктураОтвета.СуммаПревышения=  (-Выборка.СуммаОстаток+СуммаДокумента);
			СтруктураОтвета.ТекстОшибки="Проверка 2. Превышен лимит расхода на "+(-Выборка.СуммаОстаток+СуммаДокумента);
			
		КонецЕсли;
	Иначе
		СтруктураОтвета.СуммаПревышения=  (СуммаДокумента);
		СтруктураОтвета.ТекстОшибки="Проверка 2. Превышен лимит расхода на "+(СуммаДокумента);
	КонецЕсли;
	
	////Сава: 2016/05 - на перспективу, если нет счета
	//Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда 
	//	Если Выборка.Следующий() Тогда
	//		Если 	Выборка.Лимит_СуммаОстаток>=СуммаДокумента 
	//			И	Выборка.Счет_СуммаОстаток >=СуммаДокумента	Тогда
	//			СтруктураОтвета.Результат=Истина;
	//		 Иначе
	//		 	СтруктураОтвета.ТекстОшибки=
	//				?(Выборка.Лимит_СуммаОстаток>=СуммаДокумента, "",  " Превышен лимит расхода на "+(-Выборка.Лимит_СуммаОстаток+СуммаДокумента))
	//			   +?(Выборка.Счет_СуммаОстаток >=СуммаДокумента, "",  ", Превышена сумма по счету на "+(-Выборка.Счет_СуммаОстаток+СуммаДокумента)); 
	//			СтруктураОтвета.ТекстОшибки = СокрЛП(Сред(СтруктураОтвета.ТекстОшибки, 2) );
	//		 КонецЕсли;
	//	Иначе	
	//		 СтруктураОтвета.ТекстОшибки="Превышен лимит расхода и сумма по счету на "+СуммаДокумента ;
	//	 КонецЕсли;
	//Иначе 
	//	Если Выборка.Следующий() Тогда
	//		Если 	Выборка.Лимит_СуммаОстаток>=СуммаДокумента Тогда
	//			СтруктураОтвета.Результат=Истина;
	//		 Иначе
	//		 	СтруктураОтвета.ТекстОшибки=
	//				?(Выборка.Лимит_СуммаОстаток>=СуммаДокумента, "",  " Превышен лимит расхода на "+(-Выборка.Лимит_СуммаОстаток+СуммаДокумента));
	//		 КонецЕсли;
	//	Иначе	
	//		 СтруктураОтвета.ТекстОшибки="Превышен лимит расхода на "+СуммаДокумента ;
	//	КонецЕсли;	 
	//КонецЕсли;
	
	Возврат СтруктураОтвета;
	
КонецФункции
